{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "text_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "text_input"}, "inbound_nodes": []}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "conv1d_9", "class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "max_pooling1d_9", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_9", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"name": "max_pooling1d_20", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_20", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_9", 0, 0, {}]]]}, {"name": "dropout_24", "class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_20", 0, 0, {}]]]}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"name": "conv1d_21", "class_name": "Conv1D", "config": {"name": "conv1d_21", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "conv1d_45", "class_name": "Conv1D", "config": {"name": "conv1d_45", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_9", 0, 0, {}]]]}, {"name": "max_pooling1d_10", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_10", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "max_pooling1d_21", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_21", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_21", 0, 0, {}]]]}, {"name": "max_pooling1d_34", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_34", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_34", 0, 0, {}]]]}, {"name": "max_pooling1d_45", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_45", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_45", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_10", 0, 0, {}]]]}, {"name": "dropout_25", "class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_21", 0, 0, {}]]]}, {"name": "dropout_40", "class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_34", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "dropout_53", "class_name": "Dropout", "config": {"name": "dropout_53", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_45", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"name": "conv1d_22", "class_name": "Conv1D", "config": {"name": "conv1d_22", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_40", 0, 0, {}]]]}, {"name": "conv1d_40", "class_name": "Conv1D", "config": {"name": "conv1d_40", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"name": "conv1d_46", "class_name": "Conv1D", "config": {"name": "conv1d_46", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_53", 0, 0, {}]]]}, {"name": "max_pooling1d_4", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_4", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "max_pooling1d_11", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_11", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"name": "max_pooling1d_22", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_22", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]]}, {"name": "max_pooling1d_35", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_35", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "max_pooling1d_40", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_40", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]]}, {"name": "max_pooling1d_46", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_46", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "dropout_26", "class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_22", 0, 0, {}]]]}, {"name": "dropout_41", "class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_35", 0, 0, {}]]]}, {"name": "dropout_47", "class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_40", 0, 0, {}]]]}, {"name": "dropout_54", "class_name": "Dropout", "config": {"name": "dropout_54", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_46", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "conv1d_12", "class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "conv1d_16", "class_name": "Conv1D", "config": {"name": "conv1d_16", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "conv1d_23", "class_name": "Conv1D", "config": {"name": "conv1d_23", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]]}, {"name": "conv1d_36", "class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"name": "conv1d_41", "class_name": "Conv1D", "config": {"name": "conv1d_41", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_47", 0, 0, {}]]]}, {"name": "conv1d_47", "class_name": "Conv1D", "config": {"name": "conv1d_47", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_54", 0, 0, {}]]]}, {"name": "max_pooling1d_5", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "max_pooling1d_12", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_12", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"name": "max_pooling1d_16", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_16", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "max_pooling1d_23", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_23", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_23", 0, 0, {}]]]}, {"name": "max_pooling1d_36", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_36", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"name": "max_pooling1d_41", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_41", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]]}, {"name": "max_pooling1d_47", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_47", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 3804, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["text_input", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_5", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_12", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_16", 0, 0, {}]]]}, {"name": "dropout_27", "class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_23", 0, 0, {}]]]}, {"name": "dropout_42", "class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_36", 0, 0, {}]]]}, {"name": "dropout_48", "class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_41", 0, 0, {}]]]}, {"name": "dropout_55", "class_name": "Dropout", "config": {"name": "dropout_55", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_47", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 256, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "conv1d_13", "class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"name": "conv1d_17", "class_name": "Conv1D", "config": {"name": "conv1d_17", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "conv1d_24", "class_name": "Conv1D", "config": {"name": "conv1d_24", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]]}, {"name": "conv1d_37", "class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}, {"name": "conv1d_42", "class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"name": "conv1d_48", "class_name": "Conv1D", "config": {"name": "conv1d_48", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_55", 0, 0, {}]]]}, {"name": "max_pooling1d_1", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "max_pooling1d_6", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"name": "max_pooling1d_13", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_13", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"name": "max_pooling1d_17", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_17", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]]}, {"name": "max_pooling1d_24", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_24", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_24", 0, 0, {}]]]}, {"name": "max_pooling1d_37", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_37", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]]}, {"name": "max_pooling1d_42", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_42", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_42", 0, 0, {}]]]}, {"name": "max_pooling1d_48", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_48", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_6", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_13", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]]}, {"name": "dropout_28", "class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_24", 0, 0, {}]]]}, {"name": "dropout_43", "class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_37", 0, 0, {}]]]}, {"name": "dropout_49", "class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_42", 0, 0, {}]]]}, {"name": "dropout_56", "class_name": "Dropout", "config": {"name": "dropout_56", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_48", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 128, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "conv1d_14", "class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "filters": 8, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"name": "conv1d_18", "class_name": "Conv1D", "config": {"name": "conv1d_18", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"name": "conv1d_25", "class_name": "Conv1D", "config": {"name": "conv1d_25", "trainable": true, "filters": 8, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_28", 0, 0, {}]]]}, {"name": "conv1d_38", "class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_43", 0, 0, {}]]]}, {"name": "conv1d_43", "class_name": "Conv1D", "config": {"name": "conv1d_43", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"name": "conv1d_49", "class_name": "Conv1D", "config": {"name": "conv1d_49", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_56", 0, 0, {}]]]}, {"name": "max_pooling1d_2", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"name": "max_pooling1d_7", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_7", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"name": "max_pooling1d_14", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_14", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_14", 0, 0, {}]]]}, {"name": "max_pooling1d_18", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_18", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_18", 0, 0, {}]]]}, {"name": "max_pooling1d_25", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_25", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]]}, {"name": "max_pooling1d_38", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_38", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"name": "max_pooling1d_43", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_43", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_43", 0, 0, {}]]]}, {"name": "max_pooling1d_49", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_49", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_7", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_14", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_18", 0, 0, {}]]]}, {"name": "dropout_29", "class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_25", 0, 0, {}]]]}, {"name": "dropout_44", "class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_38", 0, 0, {}]]]}, {"name": "dropout_50", "class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_43", 0, 0, {}]]]}, {"name": "dropout_57", "class_name": "Dropout", "config": {"name": "dropout_57", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_49", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "filters": 64, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "conv1d_8", "class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "conv1d_15", "class_name": "Conv1D", "config": {"name": "conv1d_15", "trainable": true, "filters": 4, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"name": "conv1d_19", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "filters": 32, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"name": "conv1d_26", "class_name": "Conv1D", "config": {"name": "conv1d_26", "trainable": true, "filters": 4, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"name": "conv1d_39", "class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "filters": 8, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_44", 0, 0, {}]]]}, {"name": "conv1d_44", "class_name": "Conv1D", "config": {"name": "conv1d_44", "trainable": true, "filters": 16, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_50", 0, 0, {}]]]}, {"name": "conv1d_50", "class_name": "Conv1D", "config": {"name": "conv1d_50", "trainable": true, "filters": 8, "kernel_size": [8], "strides": [2], "padding": "same", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_57", 0, 0, {}]]]}, {"name": "max_pooling1d_3", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "max_pooling1d_8", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_8", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"name": "max_pooling1d_15", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_15", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"name": "max_pooling1d_19", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_19", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]]}, {"name": "max_pooling1d_26", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_26", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_26", 0, 0, {}]]]}, {"name": "max_pooling1d_39", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_39", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"name": "max_pooling1d_44", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_44", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_44", 0, 0, {}]]]}, {"name": "max_pooling1d_50", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_50", "trainable": true, "strides": [2], "pool_size": [2], "padding": "same"}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]]}, {"name": "numeric_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "numeric_input"}, "inbound_nodes": []}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_8", 0, 0, {}]]]}, {"name": "dropout_17", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_15", 0, 0, {}]]]}, {"name": "dropout_22", "class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_19", 0, 0, {}]]]}, {"name": "dropout_30", "class_name": "Dropout", "config": {"name": "dropout_30", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_26", 0, 0, {}]]]}, {"name": "dropout_45", "class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_39", 0, 0, {}]]]}, {"name": "dropout_51", "class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_44", 0, 0, {}]]]}, {"name": "dropout_58", "class_name": "Dropout", "config": {"name": "dropout_58", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_50", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["numeric_input", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, 